{
  "version": "https://jsonfeed.org/version/1",
  "title": "nskien.xyz",
  "home_page_url": "https://nskien.xyz/",
  "feed_url": "https://nskien.xyz/feed/feed.json",
  "description": "nice life, eh?",
  "author": {
    "name": "Kien Nguyen",
    "url": "https://nskien.com/about-me/"
  },
  "items": [{
      "id": "https://nskien.xyz/posts/setup/",
      "url": "https://nskien.xyz/posts/setup/",
      "title": "A Distraction-free Setup",
      "content_html": "<h2 id=\"distractions-are-the-enemy\">Distractions are the enemy <a class=\"direct-link\" href=\"#distractions-are-the-enemy\">#</a></h2>\n<p>A computer's primary purpose is to ease the creation, storage, and transmission of information. Any other functionalities are distractions from this core purpose.<br>\nApplications like video games, media playback, and social networking have emerged as distractions that divert attention away from a computer’s intended purpose.</p>\n<p>I do believe that there is a place for computers to be entertainment machines.<br>\nBut entertainment machines and productive machines must not combined together as one.<br>\nWhen I perform productive activities, the availability of entertainment alone is enough to distract me from the work.<br>\nI usually don't have enough brain power to resist the temptation of entertainment, and relying on willpower everytime I open a computer to work is not sustainable.</p>\n<p>When making productivity the only function available in a computer, I begin to treat it like how it's supposed to be, a tool.<br>\nI open the computer when and only when I do my work.<br>\nWhen using the work computer, I cannot do anything else outside of working on that computer.<br>\nWork is the only thing I do on the computer not because I extract alot of willpower to do it, but because the computer doesn't have the distracting functionalities that pull me away from work.</p>\n<h2 id=\"the-sword\">The sword <a class=\"direct-link\" href=\"#the-sword\">#</a></h2>\n<p>To support this idea, I’ve designed a setup dedicated only to document creation.<br>\nThis is the most minimal setup for text creation that I can come up with.<br>\nRemoving further the features of this setup will sacrifice aesthetic and convenieces.</p>\n<h3 id=\"kien's-text-creating-machine%3A\">Kien's Text Creating Machine: <a class=\"direct-link\" href=\"#kien's-text-creating-machine%3A\">#</a></h3>\n<p>Begin with a fresh Arch installation, either using the manual method or the archinstall script, then install:</p>\n<h4 id=\"display-server-(xorg)\">Display server (Xorg) <a class=\"direct-link\" href=\"#display-server-(xorg)\">#</a></h4>\n<p>A display server is installed to allow graphical programs such as window managers and browsers to be displayed. Xorg can be installed as an option in the archinstall script.</p>\n<h4 id=\"window-manager-(dwm)\">Window manager (dwm) <a class=\"direct-link\" href=\"#window-manager-(dwm)\">#</a></h4>\n<p>A window manager organizes your working windows and allow you to have multiple work spaces. With window managers, you can have dedicated worspaces for each of your work tasks. For example, in my setup, I have one workspace dedicated for text editing, and another workspace to display the rendered text document.</p>\n<h4 id=\"terminal-emulator-(st)\">Terminal Emulator (st) <a class=\"direct-link\" href=\"#terminal-emulator-(st)\">#</a></h4>\n<p>A terminal emulator is installed to extend the capability of your termial UIs. With it, you can add into your terminal functions such as copy and paste from clipboard, scroll backs, color schemes or font resize. A note here is that you will usually have a narrower color scheme options in your text editor if you don't use a terminal emulator that allows a wider range of colors.</p>\n<h4 id=\"file-manager-(lf-or-ranger)\">File manager (lf or ranger) <a class=\"direct-link\" href=\"#file-manager-(lf-or-ranger)\">#</a></h4>\n<p>To quickly navigate and preview your files. You can integrate images and document displayer into your file manager to preview files in your file manager. I reccomend <code>feh</code> for image displaying and <code>zathura</code> for document displaying.</p>\n<h4 id=\"text-editor-(neovim)\">Text editor (neovim) <a class=\"direct-link\" href=\"#text-editor-(neovim)\">#</a></h4>\n<p>A text editor is your main program to create and edit your documents in. Through different text editors, you will have different shortcuts and bindings to navigate and edit your documents. I recommend nano as an easy-to-use text editor that requires no prior learning to get started. However, nano becomes limiting quickly, that's when I urge you to learn how to use Vim. Vim bindings will forever change the way you type, and it's worth every second to learn it. This is not an article about Vim, but I'm allowing this section about Vim to be long to emphasise how much Vim bindings will make your text editing time more efficient and pleasant.</p>\n<p>I use neovim, and extended version of vim, which allows me to install unique plugins that I find useful. Start with <a href=\"https://github.com/nvim-lua/kickstart.nvim\">kickstart.nvim</a>, then install:</p>\n<ul>\n<li>A clipboard copy backend (I installed <code>xclip</code> with pacman)</li>\n<li>A different color scheme. I settled with <code>onedark</code>, a black color scheme to not get distracted by colors.</li>\n<li>Tab complete. Enable it at the  <code>nvim.cmp</code> section in <code>init.rc</code></li>\n<li>Auto closing brackets (nvim)</li>\n<li>Project view bindings with <code>vim.keymap</code> <code>vim.cmd.Ex</code></li>\n<li>Add language servers with <code>:Mason</code></li>\n<li>Relative line numbers</li>\n</ul>\n<h4 id=\"browser-(firefox)\">Browser (firefox) <a class=\"direct-link\" href=\"#browser-(firefox)\">#</a></h4>\n<p>Depending on the type of document you're creating, you may or may not need a browser on your machine. Keep in mind that browsers can be a gateway for distractions to pour in. Firefox is the easiest browser to install, I got it through pacman.</p>\n<h2 id=\"who-is-this-setup-for\">Who is this setup for <a class=\"direct-link\" href=\"#who-is-this-setup-for\">#</a></h2>\n<p>This setup is suitable for any types of text editing. Depending on your work, you would want to extend this setup with programs from your field of work, for example, Latex for complex document formatings, or compilers and git if you program software. If .docx or pdf is your primary document type, I reccommend writing and editing in Latex and export it into .docx/pdf with <code>pandoc</code>. Spreadsheets can be done on the terminal UI too, with <code>sc</code> or <code>oleo</code>.</p>\n<p>The main feature of this setup is that it’s built from a bare minimal operating system with no unnecessary applications. With only the essential programs for your work, distractions are nonexistent, leaving you with no choice but to focus or step away from the machine. A designated space to work is what this setup offers, and focus is what it will delivers. This setup embraces the &quot;one device one job&quot; philosophy, seperating the proverbial &quot;TV&quot; from the &quot;textbooks&quot;.</p>\n",
      "date_published": "2025-02-10T00:00:00Z"
    }
  ]
}
